---
kind: property
id: P:Autodesk.Revit.DB.MEPCalculationServerInfo.ServerName
source: html/0af93c3e-a7a6-1f52-66cb-0b17ef19c47b.htm
---
# Autodesk.Revit.DB.MEPCalculationServerInfo.ServerName Property

The Name of the server.

## Syntax (C#)
```csharp
public string ServerName { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null